src/Documents/ВыдачаИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаИнвентаря</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИнвентарьУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвентарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВыдачаИнвентаря/Ext/ManagerModule.bsl
Функция НапечататьАкт(СсылкаНаДокумент) Экспорт

    Макет  = Документы.ВыдачаИнвентаря.ПолучитьМакет("АктВыдачи");
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВыдачи";

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Позиции.НомерСтроки                    КАК НомерСтроки,
        |    Позиции.Инвентарь                      КАК Инвентарь,
        |    Позиции.Инвентарь.ИнвентарныйНомер     КАК ИнвентарныйНомер,
        |    Позиции.Количество                     КАК Количество
        |ИЗ
        |    Документ.ВыдачаИнвентаря.Позиции КАК Позиции
        |ГДЕ
        |    Позиции.Ссылка = &Ссылка
        |УПОРЯДОЧИТЬ ПО
        |    НомерСтроки";
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
    Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьШапка.Параметры.Организация = Константы.НаименованиеОрганизации.Получить();
    ОбластьШапка.Параметры.Номер       = СсылкаНаДокумент.Номер;
    ОбластьШапка.Параметры.Дата        = Формат(СсылкаНаДокумент.Дата, "ДЛФ=DD");
    ОбластьШапка.Параметры.Сотрудник   = СсылкаНаДокумент.Сотрудник;
    ОбластьШапка.Параметры.Должность   = СсылкаНаДокумент.Сотрудник.Должность;
    ТабДок.Вывести(ОбластьШапка);

    ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));

    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
    ВсегоПозиций  = 0;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
        ТабДок.Вывести(ОбластьСтрока);
        ВсегоПозиций = ВсегоПозиций + 1;
    КонецЦикла;

    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ОбластьПодвал.Параметры.ВсегоПозиций = ВсегоПозиций;
    ТабДок.Вывести(ОбластьПодвал);

    ТабДок.ОтображатьСетку   = Ложь;
    ТабДок.ТолькоПросмотр    = Истина;

    Возврат ТабДок;

КонецФункции
